### DJango Model Queries ###

In [43]:
import os
import django
import pandas as pd
from datetime import datetime
os.environ.setdefault('DJANGO_SETTINGS_MODULE','proj_demo.settings')
os.environ["DJANGO_ALLOW_ASYNC_UNSAFE"] = "true"
django.setup()
from app_demo.models import Department,Employee,Customer,Product,Sales,SalesItem
from django.db.models import Max,Min,Count,Sum

#### 1. Select all objects in query set

In [19]:
qs_emp = Employee.objects.all()
df_emp = pd.DataFrame.from_records(qs_emp.values())
print(type(qs_emp),' = ',len(qs_emp))
df_emp.head()

<class 'django.db.models.query.QuerySet'>  =  181

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E001,Kathryn Franklin,Officer,2016-10-24,384980.00,7940.00,92009 Trujillo Parkways Apt. 584,West Daniel,001-899-085-6984x42141,D01
1,E002,Leslie Jimenez,Officer,2017-03-25,1027540.00,4160.00,4776 Fisher Corner,Hatfieldland,419.151.2412x504,D01
2,E003,John Young,Officer,2019-04-25,753260.00,14140.00,7146 Marie Creek Apt. 024,Port Shane,(459)621-9299,D01
3,E004,Douglas Shaw,Officer,2021-07-08,1222380.00,14600.00,515 Patty Plains,New Sharon,699.925.5233,D01
4,E005,Gregory Young,Clerk,2018-04-18,915890.00,3700.00,1949 Richards Mountain,Petersonhaven,938-834-3978,D01

#### 2. Select Single object

In [22]:
obj_emp = Employee.objects.get(id='E001')
print(type(obj_emp))
print(obj_emp.name)
print(obj_emp.basic)
print(obj_emp.city)

<class 'app_demo.models.Employee'>
Kathryn Franklin
384980.00
West Daniel

#### 3. Select with filters

In [24]:
# String filter
qs_emp = Employee.objects.filter(designation='Officer')
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E001,Kathryn Franklin,Officer,2016-10-24,384980.00,7940.00,92009 Trujillo Parkways Apt. 584,West Daniel,001-899-085-6984x42141,D01
1,E002,Leslie Jimenez,Officer,2017-03-25,1027540.00,4160.00,4776 Fisher Corner,Hatfieldland,419.151.2412x504,D01
2,E003,John Young,Officer,2019-04-25,753260.00,14140.00,7146 Marie Creek Apt. 024,Port Shane,(459)621-9299,D01
3,E004,Douglas Shaw,Officer,2021-07-08,1222380.00,14600.00,515 Patty Plains,New Sharon,699.925.5233,D01
4,E014,Kristi Collier,Officer,2019-05-07,1379280.00,7540.00,5537 Cynthia Vista,New Jessicaborough,(221)933-4147x6221,D01

In [25]:
# String multiple filter
qs_emp = Employee.objects.filter(designation='Officer').filter(city='West Daniel')
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E001,Kathryn Franklin,Officer,2016-10-24,384980.00,7940.00,92009 Trujillo Parkways Apt. 584,West Daniel,001-899-085-6984x42141,D01

In [39]:
# Numeric multiple filter
qs_emp = Employee.objects.filter(basic__gte=700000).filter(basic__lte=1000000)
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E003,John Young,Officer,2019-04-25,753260.00,14140.00,7146 Marie Creek Apt. 024,Port Shane,(459)621-9299,D01
1,E005,Gregory Young,Clerk,2018-04-18,915890.00,3700.00,1949 Richards Mountain,Petersonhaven,938-834-3978,D01
2,E006,Julian Evans,Clerk,2021-07-08,940430.00,1290.00,79673 Kelly Village,Maryborough,(635)485-7045,D01
3,E009,Luke Cannon,Clerk,2018-09-08,842380.00,8370.00,767 Melissa Harbors,Port Kyleport,+1-723-349-1879,D01
4,E026,Amy Christian,Clerk,2020-03-16,836720.00,2510.00,096 Kathryn Freeway Suite 797,North Michaelstad,206.638.5088,D01

In [44]:
# Date filter
start_date = datetime(2020, 1, 1)
end_date = datetime(2020, 12, 31)
qs_emp = Employee.objects.filter(joining_date__range=(start_date,end_date))
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E011,Dave Rios,Manager,2020-09-07,1950700.00,72900.00,08198 Pham Stream,Josephside,(475)491-7303,D01
1,E026,Amy Christian,Clerk,2020-03-16,836720.00,2510.00,096 Kathryn Freeway Suite 797,North Michaelstad,206.638.5088,D01
2,E027,Stephanie Medina,Officer,2020-09-15,1859580.00,12760.00,24072 Holland Rest Suite 639,Lake Wandaview,055-374-2799,D01
3,E029,David Rodriguez,Manager,2020-01-17,8704600.00,22600.00,255 Stafford Island,Rodriguezton,+1-995-153-5192x251,D01
4,E030,Jesse Carroll,Officer,2020-07-13,565000.00,9400.00,7772 Fisher Ridges,Mccarthyton,736.382.7192x801,D01

In [50]:
# Filter with IN operator
qs_emp = Employee.objects.filter(designation__in=('Officer','Manager'))
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E001,Kathryn Franklin,Officer,2016-10-24,384980.00,7940.00,92009 Trujillo Parkways Apt. 584,West Daniel,001-899-085-6984x42141,D01
1,E002,Leslie Jimenez,Officer,2017-03-25,1027540.00,4160.00,4776 Fisher Corner,Hatfieldland,419.151.2412x504,D01
2,E003,John Young,Officer,2019-04-25,753260.00,14140.00,7146 Marie Creek Apt. 024,Port Shane,(459)621-9299,D01
3,E004,Douglas Shaw,Officer,2021-07-08,1222380.00,14600.00,515 Patty Plains,New Sharon,699.925.5233,D01
4,E007,Isabella Pugh,Manager,2016-06-15,5008200.00,35700.00,60895 Smith Dam Apt. 813,Leemouth,422-995-1190x61641,D01

In [60]:
# Filter with multiple condition
qs_emp = Employee.objects.filter(designation='Officer',basic__gte=1000000,basic__lte=1200000)
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E002,Leslie Jimenez,Officer,2017-03-25,1027540.00,4160.00,4776 Fisher Corner,Hatfieldland,419.151.2412x504,D01
1,E044,Larry Christensen,Officer,2019-11-20,1080300.00,2880.00,7082 Nicole Roads,East Brittanyland,118-868-5862,D01
2,E083,Johnathan Whitney,Officer,2019-02-14,1160940.00,19700.00,009 David Dale,West Ellenfurt,001-908-519-8230x7543,D02
3,E084,Tanya Craig,Officer,2017-06-25,1158140.00,13360.00,1390 Lisa Lane,New Kevinfort,+1-665-491-2014x6754,D02
4,E092,Teresa Hopkins,Officer,2021-10-30,1131380.00,680.00,69429 Deanna Canyon Suite 525,New Heather,474.443.2212x22679,D02

In [88]:
# Filter with or condition
from django.db.models import Q

qs_dept = Department.objects.filter(Q(name='Account')|Q(location='Pune'))
df_dept = pd.DataFrame.from_records(qs_dept.values())
df_dept.head()

    id        name location
0  D01     Account   Mumbai
1  D03  Production     Pune

#### 4. Select with like operator

In [26]:
qs_emp = Employee.objects.filter(name__startswith='Kr')
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E014,Kristi Collier,Officer,2019-05-07,1379280.00,7540.00,5537 Cynthia Vista,New Jessicaborough,(221)933-4147x6221,D01
1,E079,Kristen Andrews,Salesman,2021-10-26,357190.00,7620.00,6179 Christina Isle Apt. 959,New Deniseborough,4145204007,D02
2,E085,Kristi Clark,Area Manager,2019-07-19,1699900.00,99800.00,578 Matthew Wall,East Carolyn,001-917-594-4217x462,D02
3,E104,Krista Figueroa,Officer,2020-09-06,1175760.00,16520.00,7317 Whitehead Islands,North Erikashire,(282)538-7919,D02
4,E129,Kristin Lee,Production Head,2020-04-24,2982750.00,3150.00,13919 Hannah Pike Suite 997,Melissaland,791.852.4460,D03

In [28]:
qs_emp = Employee.objects.filter(city__contains='land')
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E002,Leslie Jimenez,Officer,2017-03-25,1027540.00,4160.00,4776 Fisher Corner,Hatfieldland,419.151.2412x504,D01
1,E044,Larry Christensen,Officer,2019-11-20,1080300.00,2880.00,7082 Nicole Roads,East Brittanyland,118-868-5862,D01
2,E061,Joseph Branch,Area Manager,2021-08-11,5275800.00,73300.00,4621 Luna Ville Suite 470,Randyland,413.364.4775x25031,D02
3,E100,Joshua Johnson,Officer,2018-03-07,307620.00,1400.00,9628 Lopez Valleys Apt. 956,Allenland,001-096-425-8583x61354,D02
4,E117,Jerome Johnson,Labour,2019-05-16,302900.00,170.00,78484 Keith Orchard,Davisland,+1-873-104-2247x60575,D03

#### 5. Select with exclude

In [46]:
qs_emp = Employee.objects.exclude(designation='Officer')
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E005,Gregory Young,Clerk,2018-04-18,915890.00,3700.00,1949 Richards Mountain,Petersonhaven,938-834-3978,D01
1,E006,Julian Evans,Clerk,2021-07-08,940430.00,1290.00,79673 Kelly Village,Maryborough,(635)485-7045,D01
2,E007,Isabella Pugh,Manager,2016-06-15,5008200.00,35700.00,60895 Smith Dam Apt. 813,Leemouth,422-995-1190x61641,D01
3,E008,Teresa Lozano,Manager,2018-12-31,3251200.00,46100.00,88940 Kenneth Freeway Suite 482,Lake Jessica,+1-210-186-3815x3575,D01
4,E009,Luke Cannon,Clerk,2018-09-08,842380.00,8370.00,767 Melissa Harbors,Port Kyleport,+1-723-349-1879,D01

#### 6. Select with order by

In [79]:
#qs_emp = Employee.objects.order_by('city')
#qs_emp = Employee.objects.order_by('city').reverse()
qs_emp = Employee.objects.order_by('-designation','city')
df_emp = pd.DataFrame.from_records(qs_emp.values())
df_emp.head()

,id,name,designation,joining_date,basic,allowence,address,city,contact_no,department_id
0,E103,Martin Mcintyre,Salesman,2017-05-23,497460.00,1440.00,6571 Rivera Creek,East Tammyhaven,359.247.3382,D02
1,E087,Kevin Garcia,Salesman,2017-05-28,457780.00,4490.00,743 Lawrence Lodge Suite 202,Greggshire,(474)210-5564x6122,D02
2,E070,Robert Noble,Salesman,2019-01-18,726610.00,430.00,46200 Kevin Mission,Hallhaven,001-803-477-6707x8233,D02
3,E068,Thomas Allison,Salesman,2020-11-14,186910.00,1830.00,252 Denise Shoal Apt. 213,Hardington,944.401.0174,D02
4,E067,Michelle Sherman,Salesman,2017-12-17,219180.00,5370.00,70710 Boone Squares,Karenside,+1-772-131-2782x449,D02

#### 7. Select with group by

In [102]:
qs_emp = Employee.objects.values('designation').annotate(total_allwoence=Sum('allowence')).order_by('designation')
df_emp = pd.DataFrame.from_records(qs_emp)
df_emp

       designation total_allwoence
0     Area Manager          775900
1            Clerk          119080
2         Engineer           80420
3           Labour           30600
4          Manager         1975700
5          Officer          597160
6  Production Head          207050
7         Salesman           47780

In [103]:
# Agggergate without group column
dict_stats = Employee.objects.aggregate(sum_allwoence=Sum('allowence'),min_allwoence=Min('allowence'),max_allwoence=Max('allowence'))
dict_stats

{'sum_allwoence': Decimal('3833690'),
 'min_allwoence': Decimal('20'),
 'max_allwoence': Decimal('99800')}